; domain
;; The mekorama world (see https://www.youtube.com/watch?v=LH6qBnDpMUo).
;; Tile positions are encoded by the predicate (at <tile> <x> <y>), indicating
;; the coordinates of the head of the tile .
;; The predicate "inc"  encodes addition of positions.
(define (domain mekoramaworld)
  (:requirements :strips)
  (:predicates
   (pos ?p)
   (at ?t ?x ?y)
   (blank ?x ?y)
   (inc ?p ?p1)
   (ver2 ?t)
   (ver3 ?t)
   (hor2 ?t))

  (:action moveup-ver2
    :parameters (?t ?x ?y1 ?y2 ?y3)
    :precondition (and (ver2 ?t) (pos ?x) (pos ?y1) (pos ?y2) (pos ?y3)
                       (inc ?y1 ?y2) (inc ?y2 ?y3) (blank ?x ?y3)  (at ?t ?x ?y1))
    :effect (and (blank ?x ?y1) (at ?t ?x ?y2) (not (at ?t ?x ?y1)) (not (blank ?x ?y3))))

  (:action movedown-ver2
    :parameters (?t ?x ?y1 ?y2 ?y3)
    :precondition (and (ver2 ?t) (pos ?x) (pos ?y1) (pos ?y2) (pos ?y3)
                       (inc ?y1 ?y2) (inc ?y2 ?y3)
		       (blank ?x ?y1)  (at ?t ?x ?y2))
    :effect (and (blank ?x ?y3) (at ?t ?x ?y1) (not (at ?t ?x ?y2)) (not (blank ?x ?y1))))

  (:action moveup-ver3
    :parameters (?t ?x ?y1 ?y2 ?y3 ?y4)
    :precondition (and (ver3 ?t) (pos ?x) (pos ?y1) (pos ?y2) (pos ?y3) (pos ?y4)
                       (inc ?y1 ?y2) (inc ?y2 ?y3) (inc ?y3 ?y4)
		       (blank ?x ?y4) (at ?t ?x ?y2))
    :effect (and (blank ?x ?y1) (at ?t ?x ?y3) (not (at ?t ?x ?y2)) (not (blank ?x ?y4))))

  (:action movedown-ver3
    :parameters (?t ?x ?y1 ?y2 ?y3 ?y4)
    :precondition (and (ver3 ?t) (pos ?x) (pos ?y1) (pos ?y2) (pos ?y3) (pos ?y4)
                       (inc ?y1 ?y2) (inc ?y2 ?y3) (inc ?y3 ?y4)
		       (blank ?x ?y1) (at ?t ?x ?y3))
    :effect (and (blank ?x ?y4) (at ?t ?x ?y2) (not (at ?t ?x ?y3)) (not (blank ?x ?y1))))

  (:action moveright-hor2
    :parameters (?t ?x1 ?x2 ?x3 ?y)
    :precondition (and (hor2 ?t) (pos ?x1) (pos ?x2) (pos ?x3) (pos ?y)
                       (inc ?x1 ?x2) (inc ?x2 ?x3)
		       (blank ?x3 ?y) (at ?t ?x1 ?y))
    :effect (and (blank ?x1 ?y) (at ?t ?x2 ?y) (not (at ?t ?x1 ?y)) (not (blank ?x3 ?y))))

  (:action moveleft-hor2
    :parameters (?t ?x1 ?x2 ?x3 ?y)
    :precondition (and (hor2 ?t) (pos ?x1) (pos ?x2) (pos ?x3) (pos ?y)
                       (inc ?x1 ?x2) (inc ?x2 ?x3)
		       (blank ?x1 ?y) (at ?t ?x2 ?y))
    :effect (and (blank ?x3 ?y) (at ?t ?x1 ?y) (not (at ?t ?x2 ?y)) (not (blank ?x1 ?y)))))

; problem
(define (problem mekorama26)   ;; this is a skeleton to a problem file for the mekorama26 puzzle
   (:domain mekoramaworld)
   (:objects t1 t2 t3 t4 t5 t6 t7 
             x1 x2 x3 x4 x5 x6
             y1 y2 y3 y4 y5 y6)   ;; all objects
             
   (:init (pos x1) (pos x2) (pos x3) (pos x4) (pos x5) (pos x6)     ;; positions and their relations    
          (pos y1) (pos y2) (pos y3) (pos y4) (pos y5) (pos y6)
	      (inc x1 x2)
	      (inc x2 x3)
	      (inc x3 x4)
	      (inc x4 x5)
	      (inc x5 x6)
	      (inc y1 y2)
	      (inc y2 y3)
	      (inc y3 y4)
	      (inc y4 y5)
	      (inc y5 y6)
	      
	      (hor2 t1) (at t1 x1 y4)   ;; where are the tiles?
	      (ver3 t2) (at t2 x3 y4)
          (ver3 t3) (at t3 x4 y5)
          (hor2 t4) (at t4 x4 y3)
          (ver3 t5) (at t5 x6 y3)
          (ver2 t6) (at t6 x2 y1)
          (hor2 t7) (at t7 x5 y1)
          
	      (blank x1 y6) ;; which slots are empty?
	      (blank x1 y5) 
	      (blank x1 y3) 
	      (blank x1 y2) 
	      (blank x1 y1)
	      (blank x2 y6) 
	      (blank x2 y5) 
	      (blank x2 y3) 
	      (blank x3 y6) 
	      (blank x3 y2) 
	      (blank x3 y1) 
	      (blank x4 y2) 
	      (blank x4 y1) 
	      (blank x5 y6) 
	      (blank x5 y5) 
	      (blank x5 y4) 
	      (blank x5 y2) 
	      (blank x6 y6) 
          (blank x6 y5))
          
   (:goal (at t1 x5 y4) ))   ;; goal is to move tile t1 to the exit at x5 y4

; plan
1. (movedown-ver3 t2 x3 y2 y3 y4 y5)
   deleted: (at t2 x3 y4) (blank x3 y2)
   added: (blank x3 y5) (at t2 x3 y3)
   goals met: 0 of 1
2. (movedown-ver3 t2 x3 y1 y2 y3 y4)
   deleted: (at t2 x3 y3) (blank x3 y1)
   added: (blank x3 y4) (at t2 x3 y2)
   goals met: 0 of 1
3. (moveright-hor2 t1 x1 x2 x3 y4)
   deleted: (at t1 x1 y4) (blank x3 y4)
   added: (blank x1 y4) (at t1 x2 y4)
   goals met: 0 of 1
4. (moveup-ver3 t5 x6 y2 y3 y4 y5)
   deleted: (at t5 x6 y3) (blank x6 y5)
   added: (blank x6 y2) (at t5 x6 y4)
   goals met: 0 of 1
5. (moveup-ver3 t5 x6 y3 y4 y5 y6)
   deleted: (at t5 x6 y4) (blank x6 y6)
   added: (blank x6 y3) (at t5 x6 y5)
   goals met: 0 of 1
6. (moveright-hor2 t4 x4 x5 x6 y3)
   deleted: (at t4 x4 y3) (blank x6 y3)
   added: (blank x4 y3) (at t4 x5 y3)
   goals met: 0 of 1
7. (movedown-ver3 t3 x4 y3 y4 y5 y6)
   deleted: (at t3 x4 y5) (blank x4 y3)
   added: (blank x4 y6) (at t3 x4 y4)
   goals met: 0 of 1
8. (movedown-ver3 t3 x4 y2 y3 y4 y5)
   deleted: (at t3 x4 y4) (blank x4 y2)
   added: (blank x4 y5) (at t3 x4 y3)
   goals met: 0 of 1
9. (movedown-ver3 t3 x4 y1 y2 y3 y4)
   deleted: (at t3 x4 y3) (blank x4 y1)
   added: (blank x4 y4) (at t3 x4 y2)
   goals met: 0 of 1
10. (moveright-hor2 t1 x2 x3 x4 y4)
   deleted: (at t1 x2 y4) (blank x4 y4)
   added: (blank x2 y4) (at t1 x3 y4)
   goals met: 0 of 1
11. (moveup-ver2 t6 x2 y1 y2 y3)
   deleted: (at t6 x2 y1) (blank x2 y3)
   added: (blank x2 y1) (at t6 x2 y2)
   goals met: 0 of 1
12. (moveup-ver2 t6 x2 y2 y3 y4)
   deleted: (at t6 x2 y2) (blank x2 y4)
   added: (blank x2 y2) (at t6 x2 y3)
   goals met: 0 of 1
13. (moveup-ver2 t6 x2 y3 y4 y5)
   deleted: (at t6 x2 y3) (blank x2 y5)
   added: (blank x2 y3) (at t6 x2 y4)
   goals met: 0 of 1
14. (moveup-ver2 t6 x2 y4 y5 y6)
   deleted: (at t6 x2 y4) (blank x2 y6)
   added: (blank x2 y4) (at t6 x2 y5)
   goals met: 0 of 1
15. (moveleft-hor2 t1 x2 x3 x4 y4)
   deleted: (at t1 x3 y4) (blank x2 y4)
   added: (blank x4 y4) (at t1 x2 y4)
   goals met: 0 of 1
16. (moveup-ver3 t3 x4 y1 y2 y3 y4)
   deleted: (at t3 x4 y2) (blank x4 y4)
   added: (blank x4 y1) (at t3 x4 y3)
   goals met: 0 of 1
17. (moveleft-hor2 t1 x1 x2 x3 y4)
   deleted: (at t1 x2 y4) (blank x1 y4)
   added: (blank x3 y4) (at t1 x1 y4)
   goals met: 0 of 1
18. (moveup-ver3 t3 x4 y2 y3 y4 y5)
   deleted: (at t3 x4 y3) (blank x4 y5)
   added: (blank x4 y2) (at t3 x4 y4)
   goals met: 0 of 1
19. (moveup-ver3 t3 x4 y3 y4 y5 y6)
   deleted: (at t3 x4 y4) (blank x4 y6)
   added: (blank x4 y3) (at t3 x4 y5)
   goals met: 0 of 1
20. (moveleft-hor2 t7 x4 x5 x6 y1)
   deleted: (at t7 x5 y1) (blank x4 y1)
   added: (blank x6 y1) (at t7 x4 y1)
   goals met: 0 of 1
21. (moveleft-hor2 t4 x4 x5 x6 y3)
   deleted: (at t4 x5 y3) (blank x4 y3)
   added: (blank x6 y3) (at t4 x4 y3)
   goals met: 0 of 1
22. (moveup-ver3 t2 x3 y1 y2 y3 y4)
   deleted: (at t2 x3 y2) (blank x3 y4)
   added: (blank x3 y1) (at t2 x3 y3)
   goals met: 0 of 1
23. (moveup-ver3 t2 x3 y2 y3 y4 y5)
   deleted: (at t2 x3 y3) (blank x3 y5)
   added: (blank x3 y2) (at t2 x3 y4)
   goals met: 0 of 1
24. (moveup-ver3 t2 x3 y3 y4 y5 y6)
   deleted: (at t2 x3 y4) (blank x3 y6)
   added: (blank x3 y3) (at t2 x3 y5)
   goals met: 0 of 1
25. (moveleft-hor2 t4 x3 x4 x5 y3)
   deleted: (at t4 x4 y3) (blank x3 y3)
   added: (blank x5 y3) (at t4 x3 y3)
   goals met: 0 of 1
26. (moveleft-hor2 t4 x2 x3 x4 y3)
   deleted: (at t4 x3 y3) (blank x2 y3)
   added: (blank x4 y3) (at t4 x2 y3)
   goals met: 0 of 1
27. (movedown-ver3 t3 x4 y3 y4 y5 y6)
   deleted: (at t3 x4 y5) (blank x4 y3)
   added: (blank x4 y6) (at t3 x4 y4)
   goals met: 0 of 1
28. (movedown-ver3 t3 x4 y2 y3 y4 y5)
   deleted: (at t3 x4 y4) (blank x4 y2)
   added: (blank x4 y5) (at t3 x4 y3)
   goals met: 0 of 1
29. (movedown-ver3 t5 x6 y3 y4 y5 y6)
   deleted: (at t5 x6 y5) (blank x6 y3)
   added: (blank x6 y6) (at t5 x6 y4)
   goals met: 0 of 1
30. (movedown-ver3 t5 x6 y2 y3 y4 y5)
   deleted: (at t5 x6 y4) (blank x6 y2)
   added: (blank x6 y5) (at t5 x6 y3)
   goals met: 0 of 1
31. (moveleft-hor2 t4 x1 x2 x3 y3)
   deleted: (at t4 x2 y3) (blank x1 y3)
   added: (blank x3 y3) (at t4 x1 y3)
   goals met: 0 of 1
32. (movedown-ver3 t2 x3 y3 y4 y5 y6)
   deleted: (at t2 x3 y5) (blank x3 y3)
   added: (blank x3 y6) (at t2 x3 y4)
   goals met: 0 of 1
33. (movedown-ver3 t2 x3 y2 y3 y4 y5)
   deleted: (at t2 x3 y4) (blank x3 y2)
   added: (blank x3 y5) (at t2 x3 y3)
   goals met: 0 of 1
34. (movedown-ver3 t5 x6 y1 y2 y3 y4)
   deleted: (at t5 x6 y3) (blank x6 y1)
   added: (blank x6 y4) (at t5 x6 y2)
   goals met: 0 of 1
35. (moveleft-hor2 t7 x3 x4 x5 y1)
   deleted: (at t7 x4 y1) (blank x3 y1)
   added: (blank x5 y1) (at t7 x3 y1)
   goals met: 0 of 1
36. (moveleft-hor2 t7 x2 x3 x4 y1)
   deleted: (at t7 x3 y1) (blank x2 y1)
   added: (blank x4 y1) (at t7 x2 y1)
   goals met: 0 of 1
37. (movedown-ver3 t3 x4 y1 y2 y3 y4)
   deleted: (at t3 x4 y3) (blank x4 y1)
   added: (blank x4 y4) (at t3 x4 y2)
   goals met: 0 of 1
38. (moveleft-hor2 t7 x1 x2 x3 y1)
   deleted: (at t7 x2 y1) (blank x1 y1)
   added: (blank x3 y1) (at t7 x1 y1)
   goals met: 0 of 1
39. (movedown-ver3 t2 x3 y1 y2 y3 y4)
   deleted: (at t2 x3 y3) (blank x3 y1)
   added: (blank x3 y4) (at t2 x3 y2)
   goals met: 0 of 1
40. (moveright-hor2 t1 x1 x2 x3 y4)
   deleted: (at t1 x1 y4) (blank x3 y4)
   added: (blank x1 y4) (at t1 x2 y4)
   goals met: 0 of 1
41. (moveright-hor2 t1 x2 x3 x4 y4)
   deleted: (at t1 x2 y4) (blank x4 y4)
   added: (blank x2 y4) (at t1 x3 y4)
   goals met: 0 of 1
42. (moveright-hor2 t1 x3 x4 x5 y4)
   deleted: (at t1 x3 y4) (blank x5 y4)
   added: (blank x3 y4) (at t1 x4 y4)
   goals met: 0 of 1
43. (moveright-hor2 t1 x4 x5 x6 y4)
   deleted: (at t1 x4 y4) (blank x6 y4)
   added: (blank x4 y4) (at t1 x5 y4)
   goals met: 1 of 1
